#### Terraform Plan 📖
```
random_id.bucket_suffix: Refreshing state... [id=npPScg]
module.storage_bucket_test.google_storage_bucket.this: Refreshing state... [id=test-bucket-9e93d272]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # random_id.bucket_suffix will be destroyed
  # (because random_id.bucket_suffix is not in configuration)
  - resource "random_id" "bucket_suffix" {
      - b64_std     = "npPScg==" -> null
      - b64_url     = "npPScg" -> null
      - byte_length = 4 -> null
      - dec         = "2660487794" -> null
      - hex         = "9e93d272" -> null
      - id          = "npPScg" -> null
    }

  # module.storage_bucket_test.google_storage_bucket.this will be destroyed
  # (because google_storage_bucket.this is not in configuration)
  - resource "google_storage_bucket" "this" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "environment" = "test"
          - "managed_by"  = "terraform"
          - "module"      = "gcp_storage_bucket"
          - "purpose"     = "validation"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "test-bucket-9e93d272" -> null
      - labels                      = {
          - "environment" = "test"
          - "managed_by"  = "terraform"
          - "module"      = "gcp_storage_bucket"
          - "purpose"     = "validation"
        } -> null
      - location                    = "US" -> null
      - name                        = "test-bucket-9e93d272" -> null
      - project                     = "fascinante-digit-1698295291643" -> null
      - project_number              = 304053580743 -> null
      - public_access_prevention    = "enforced" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/test-bucket-9e93d272" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "environment" = "test"
          - "managed_by"  = "terraform"
          - "module"      = "gcp_storage_bucket"
          - "purpose"     = "validation"
        } -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://test-bucket-9e93d272" -> null

      - soft_delete_policy {
          - effective_time             = "2025-11-04T02:47:29.538Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.worker_test.cloudflare_worker_script.this will be created
  + resource "cloudflare_worker_script" "this" {
      + account_id          = "805bb4fea4f198df0f788aaaad22a1be"
      + compatibility_flags = (known after apply)
      + content             = <<-EOT
            /**
             * Worker de prueba para validar el pipeline
             * Este worker responde con información básica
             * Compatible con Cloudflare Workers (no ES6 modules)
             */
            addEventListener('fetch', event => {
              event.respondWith(handleRequest(event.request))
            })
            
            async function handleRequest(request) {
              const url = new URL(request.url);
            
              return new Response(JSON.stringify({
                message: 'Worker de prueba - Infra Elite',
                path: url.pathname,
                method: request.method,
                timestamp: new Date().toISOString(),
                worker: 'test-worker'
              }), {
                headers: {
                  'Content-Type': 'application/json',
                  'Access-Control-Allow-Origin': '*'
                }
              });
            }
        EOT
      + id                  = (known after apply)
      + name                = "test-worker"
      + tags                = (known after apply)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Warning: Deprecated Resource

  with module.worker_test.cloudflare_worker_script.this,
  on modules/cloudflare_worker/main.tf line 1, in resource "cloudflare_worker_script" "this":
   1: resource "cloudflare_worker_script" "this" {

`cloudflare_worker_script` is now deprecated and will be removed in the next
major version. Use `cloudflare_workers_script` instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
_Pusheado por: @alexanderovie_